programa 
{
  //Bhaskara

  inclua biblioteca Matematica --> mat

  funcao inicio() 
  {
    real a, b, c, x1, x2, delta, raiz_delta

    escreva ("Qual é o valor de A: ")
    leia (a)
    escreva ("Qual é o valor de B: ")
    leia (b)
    escreva ("Qual é o valor de C: ")
    leia (c)

    se (a == 0)
    {
      escreva ("\n O termo A é igual a zero. Não é uma equação de segundo grau.")
      escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
      escreva ("\n O valor de A necessita de ser diferente de zero para ser uma equação de segundo grau.")
      escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
    }
    senao
    {
      delta = mat.potencia (b, 2.0) - 4*a*c
      escreva ( "\n O valor de delta é igual a: ",delta,"")
      escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
      se (delta == 0)
      {
        escreva ("\n Delta é igual a zero. O resuldado é uma raiz única.")
        escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
        x1 = (-b)/2*a
        escreva ("\n O valor de X1 é igual a: ",x1,"")
        escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
      }
      senao
      {
        se (delta > 0)
        {
          escreva ("\n Delta é maior que zero. O resultado possui dua raízes.")
          escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
          raiz_delta = mat.raiz (delta, 2.0)
          escreva ("\n A raiz de delta é igual a: ",raiz_delta,"")
          escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
          x1 = ((-b) + raiz_delta)/2*a
          x2 = ((-b) - raiz_delta)/2*a
          escreva ("\n O valor de X1 é igual a: ",x1,"")
          escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
          escreva ("\n O valor de X2 é igual a: ",x2,"")
          escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------")
        }
      }            
        se (delta < 0)
        {
          escreva ("\n Delta é negativo. A equação não possui raízes reais.")
          escreva ("\n --------------------------------------------------------------------------------------------------------------------------------------------------") 
        }  
      
    }

  }
}
